<a href="https://colab.research.google.com/github/GabrielIFPB/data_science/blob/gabriel/pandas/pre_processamento_credit_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [18]:
import pandas as pd
base = pd.read_csv('/content/sample_data/credit_data.csv')
base.head()

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1

In [6]:
base.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [8]:
base.loc[base['age'] < 0]

    clientid        income        age         loan  default
15        16  50501.726689 -28.218361  3977.287432        0
21        22  32197.620701 -52.423280  4244.057136        0
26        27  63287.038908 -36.496976  9595.286289        0

In [14]:
# apagar a coluna
base.drop('age', 1, inplace=True)
base.head()

   clientid        income         loan  default
0         1  66155.925095  8106.532131        0
1         2  34415.153966  6564.745018        0
2         3  57317.170063  8020.953296        0
3         4  42709.534201  6103.642260        0
4         5  66952.688845  8770.099235        1

In [16]:
# apagar somente os registros com problemas
base.drop(base[base.age < 0].index, inplace=True)

In [17]:
base.loc[base['age'] < 0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [20]:
base.mean()

clientid     1000.500000
income      45331.600018
age            40.807559
loan         4444.369695
default         0.141500
dtype: float64

In [21]:
base['age'].mean()

40.80755937840458

In [22]:
base['age'][base.age > 0].mean()

40.92770044906149

In [23]:
base.loc[base.age < 0, 'age'] = 40.92

In [24]:
base.loc[base['age'] < 0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []